{"appnews":{"appid":700330,"newsitems":[{"gid":"5151600576584057562","title":"13.0 Refracted Reality Feedback Survey","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5151600576584057562","is_external_url":true,"author":"ZirconZer0","contents":"Hello everyone!\n\nWith the recent release of the 13.0 update, ‘Refracted Reality’, we hope you’ve had a chance to experience and enjoy the new features. We’re eager to hear what your thoughts are about our latest changes and we invite you to fill out our feedback survey with the below link:\n\n[url=https://forms.gle/JSbzMdQ15XRZkCDu6]https://forms.gle/JSbzMdQ15XRZkCDu6[/url]\n\nWe appreciate and thank everyone who has participated in the update. \n\n[i]~ Northwood Studios[/i]\n","feedlabel":"Community Announcements","date":1684925661,"feedname":"steam_community_announcements","feed_type":1,"appid":700330},{"gid":"5138087875098571783","title":"13.0 Out Now!","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5138087875098571783","is_external_url":true,"author":"☢Commander Shadow☢","contents":"Hello eveyone!\n\nWe're excited to announce that update 13.0, 'Refracted Reality', has now been fully released to the public!\n\nWe want to thank everyone for continuing to support us throughout the duration of the Patreon beta. \nThis update is set to become one of our most game-changing, greatly affecting how SCP: SL will feel going forward.\n\nNow, we'd like to share a brief trailer of 13.0 — which showcases the visual changes through a side by side comparison with previous game versions: \nhttps://link.scpslgame.com/13.0-Trailer\n\n\nPatch Notes of 13.0: \nhttps://link.scpslgame.com/13.0-Changelog\n\n\nOnce again, we'd like to thank everyone for their continued support throughout the years — SCP: SL will continue to grow thanks to you.\n\n~ Northwood Studios\n","feedlabel":"Community Announcements","date":1683658816,"feedname":"steam_community_announcements","feed_type":1,"appid":700330},{"gid":"5138087875098566603","title":"Version 13.0 — ‘Refracted Reality’","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5138087875098566603","is_external_url":true,"author":"xEnded","contents":"Hello everyone. Today we are proud to announce that our next major update, ‘Refracted Reality’, is now available. From an update to our game engine, to the implementation of an entirely new rendering pipeline, this update is likely our largest technical update ever.\n\n[h2]Unity 2021 and HDRP[/h2]\nAs you may know, SCP:SL runs on the game engine ‘Unity’. We have been using a version of Unity from 2019, alongside the standard rendering pipeline — the system that makes it possible to display SCP:SL. With this update, we have not only updated our Unity version to 2021 Long Term Support, the process of updating Unity has also allowed for us to change our rendering pipeline. With this new High Definition Rendering Pipeline (HDRP) system, the entirety of SCP:SL has received a massive graphical overhaul.\n\nHDRP opens the doors for us to explore a lot more in terms of practical visuals, alongside better support for higher end graphic cards, resulting in a performance increase. Overall, these massive technical updates to the core of the game will help us tremendously in terms of development and making SCP:SL the best it can be.\n\n[b]What differences can you expect to see with this update?[/b]\n[list]\n[*] Improvements to room lighting and overall atmosphere.\n[*] Improvements to several particle effects (SCP-244, gun-related particles, and more).\n[*] A complete reimplementation of all visual effects — spanning from 1:1 conversions, to total redesigns.\n[*] Viewmodels are now affected by light sources.\n[*] New decorations for some rooms within the Facility.\n[/list]\n\n[h2]SCP Additions[/h2]\nThis update also brings some minor changes and improvements to SCP-079 and SCP-939. Whilst not much, we hope these changes help improve the playing experience for both classes.\n\n[h3]SCP-079 Changes[/h3]\n[list]\n[*] Added a new ability: [i]Breach Scanner[/i]. Unlocked at Tier 4, this ability can be activated on a per-zone basis. Every 20 seconds, SCP-079 will scan the zone for players who have not moved a significant distance for an extended period of time. If a player is found, SCP-079 will be notified, the player marked on SCP-079’s map, and alarms will sound around the human player. \n[*] Added unique audio for locking doors, initiating the [i]Lockdown[/i] ability, opening and closing doors, and activating elevators.\n[*] When a player uses any ability which reduces AP regen, a red notification will appear above the AP/EXP bars.\n[*] Cleaned up SCP-079’s UI.\n[/list]\n\n[h3]SCP-939 Mimicry Menu[/h3]\n[list]\n[*] Massively overhauled the [i]Mimicry[/i] ability menu. Instead of being a radial menu with multiple sections, everything is now available from one easy-to-use menu.\n[*] Added the ability to favourite voice lines. Favourited voice lines can be played by pressing the respective number on your keyboard. These hotkeys will remain locked to the voiceline (i.e. removing hotkey two will not affect the keybind for hotkey three). Favourited voice lines will not be overridden by newly captured voices.\n[*] Added the ability to drag and drop voice clips within the [i]Stolen Voices[/i] submenu.\n[*] Added the ability to trim voice clips, now allowing SCP-939 to use specific parts of a chosen voiceline. ([b]Thanks to krustylesponge for the idea![/b])\n[*] Added a distance meter for SCP-939’s mimicry point. \n[*] Improved gunshot variation when selecting a weapon to mimic.\n[*] Replaced civilian class mimicry with the ability to mimic an item of your choice. \n[*] Reduced the cooldown of [i]Mimicry[/i] overall.\n[/list]\n\n[h2]Gameplay Changes[/h2]\n[list]\n[*] Added special inspect sounds and animations to the [i]Jailbird[/i] depending on its durability.\n[*] Added a workstation near the escape section of the Surface Zone. ([b]Thanks to Dan for the idea![/b])\n[*] Added a hitmarker to flashbangs. ([b]Thanks to DrPri for the idea![/b])\n[*] Added a Facility Manager keycard to the armoury inside of SCP-079’s chamber.\n[*] Increased base 9mm ammo capacity to 40 (from 30).\n[*] Improved SCP-018 hit registration. ([b]Thanks to JP for the idea![/b])\n[*] Decreased the amount of time that SCP-173 can ‘hold’ a blink, two seconds max (from three).\n[*] Modified the [i]Micro-H.I.D.[/i] recipes in SCP-914. A [i]Micro-H.I.D.[/i] on [i]Coarse[/i] will now become either a [i]Jailbird[/i] or [i]3-X Particle Disruptor[/i] at a 50/50% chance.\n[*] Modified the [i]Jailbird[/i] and [i]3-X Particle Disruptor[/i] recipes in SCP-914. They will both become one another on [i]1:1[/i], and will upgrade into the [i]Micro-H.I.D.[/i] on [i]Very Fine[/i].\n[*] Modified the [i]Jailbird[/i] recipes in SCP-914. A [i]Jailbird[/i] will now become red on [i]Coarse[/i] (exploding after the next use). A [i]Jailbird[/i] will now become a flashlight on [i]Rough[/i]. \n[*] Updated inventory icons for SCP-2176, SCP-207, SCP-268, and the [i]Micro-H.I.D.[/i]\n[*] Added new loading screens.\n[*] Added new loading screen tips.\n[/list]\n\n\n[h2]Achievement Tweaks[/h2]\nIt is no secret that SCP:SL’s achievements have gone relatively untouched as the game has evolved throughout the years. With many achievements rewarding misplays, intentional deaths, and even being impossible to unlock, we have gone ahead and provided some well needed tweaks to our current achievements list.\n\nFound below is a list detailing all changes to our achievements:\n\n[h3]‘Is this your first time?’[/h3]\n[list]\n[*] Renamed to [b]‘Don’t Blink’[/b]\n[*] Previously awarded when a player’s neck is snapped by SCP-173. Now awarded when a player successfully escapes SCP-173.\n[/list]\n[h3]‘Newb’[/h3]\n[list]\n[*] Renamed to [b]‘Melancholy of Decay’[/b]\n[*] Previously awarded when a player dies within SCP-106’s Pocket Dimension. Now awarded to SCP-106 when it sends a player to the Pocket Dimension within five seconds of emerging from the ground.\n[/list]\n[h3]‘Deep Fried’[/h3]\n[list]\n[*] Renamed to [b]‘Proceed with Caution’[/b]\n[*] Previously awarded when a player dies from a Tesla gate zap. Now awarded when a player successfully passes through a Tesla gate observed by SCP-079.\n[/list]\n[h3]‘Look! I’m a Rocket!’[/h3]\n[list]\n[*] Renamed to [b]‘Fire In The Hole’[/b]\n[*] Previously awarded when a player dies from their own grenade. Now awarded when a player kills another player with a grenade.\n[/list]\n[h3]‘Gravity Works Here!’[/h3]\n[list]\n[*] Renamed to [b]‘Walk It Off’[/b]\n[*] Previously awarded when a player dies from fall damage. Now awarded when a player takes half their current HP as fall damage.\n[/list]\n[h3]‘Pew Pew!’[/h3]\n[list]\n[*] Renamed to [b]‘Be Polite. Be Efficient.’[/b]\n[*] Unlocking criteria remains the same (kill five enemies in less than 30 seconds). Timer now starts upon the first kill instead of when the weapon is drawn.\n[/list]\n[h3]‘Overpowered!’[/h3]\n[list]\n[*] Renamed to [b]‘Executive Access’[/b]\n[/list]\n[h3]‘Wow, really?’[/h3]\n[list]\n[*] Renamed to [b]‘Anomalously Efficient’[/b]\n[*] Previously awarded when a player dies within the first minute of the game. Now awarded when an SCP kills someone within the first minute.\n[/list]\n[h3]‘Escape Artist’[/h3]\n[list]\n[*] Previously awarded when a player escapes the Facility within three minutes. Now awarded when a player is first to escape the Facility.\n[/list]\n[h3]‘I’ll Pass, Thanks’[/h3]\n[list]\n[*] Previously awarded when an SCP kills someone charging or firing the [i]Micro-H.I.D.[/i] Now additionally awarded if SCP-106 teleports them to the Pocket Dimension.\n[/list]\n[h3]‘Involuntary Rage Quit’[/h3]\n[list]\n[*] Renamed to [b]‘Pacified’[/b]\n[*] Previously awarded to SCP-096 when it was killed during its charge up period. Now awarded to the player who kills SCP-096 during this time.\n[/list]\n[h3]‘Secure. Contain. Protect.’[/h3]\n[list]\n[*] Previously awarded to the player who pressed SCP-106’s femur breaker button. Now awarded to a member of MTF who kills the final SCP, SCP-079 and SCP-049-2’s excluded.\n[/list]\n[h3]‘CHAAOOOOS!’[/h3]\n[list]\n[*] Renamed to [b]‘We of Delta Command…’[/b]\n[/list]\n[h3]‘NANI?!’[/h3]\n[list]\n[*] Renamed to [b]‘Access Granted’[/b]\n[/list]\n[h3]‘Gear Up, Boys!’[/h3]\n[list]\n[*] Renamed to [b]‘Lights Out’[/b]\n[/list]\n[h3]‘Larry Is Your Friend!’[/h3]\n[list]\n[*] Renamed to [b]‘He’ll Be Back…’[/b]\n[/list]\n[h3]‘The Tables Have Turned’[/h3]\n[list]\n[*] Renamed to [b]‘Change in Command’[/b]\n[/list]\n[h3]‘Halloween!’[/h3]\n[list]\n[*] Renamed to [b]‘Happy Halloween!’[/b]\n[/list]\nAlready have all the achievements unlocked, but want to experience these new ones? In the ‘Other’ section of the settings menu, there is a button that can reset all your achievements. [b]Please Note: This cannot be undone and will reset your achievement unlock date.[/b]\n\n[h2]Technical Changes[/h2]\n[h3]RemoteAdmin (RA) Changes[/h3]\n[list]\n[*] Added the Filmmaker role.\n[*] Added the ‘stripdown’ debug command, printing out all properties and fields of an instantiated object. \n[*] Improved first round log entries. \n[*] Added a warning if a player attempts to ban themselves through Remote Admin (RA).\n[*] The ‘Speak’ command will now automatically toggle when run, instead of requiring an on/off statement.\n[*] Disconnecting from a server is now logged on the server console. \n[*] Added aliases for the buildinfo command.\n[*] Fixed two predefined ban reasons not being selectable.\n[*] Fixed a client-side softlock occurring when a player joins while an item is falling out of the pocket dimension. \n[*] Fixed player_count and full_player_count command interpolation including non-players.\n[*] Fixed mutes not applying correctly if a user is both muted and intercom muted. \n[*] Spawn protection now protects users from negative status effects.\n[*] Fixed an issue disallowing you to jump from page 79 to 80 in the CASSIE RA menu.\n[*] Potentially fixed RA tokens page breaking based on the selected game language.\n[/list]\n\n[h3]Overwatch Changes[/h3]\n[list]\n[*] The ‘forcerole’ command now ignores players in Overwatch if a non-Overwatch player is selected. \n[*] Added noclip, status effect, and speed indicators to the Overwatch HUD.\n[*] Fixed the Overwatch HUD not properly displaying if a player in Overwatch does not have the GameplayData permission.\n[/list]\n\n[h2]Miscellaneous Changes and Fixes[/h2]\n[list]\n[*] SCP-914’s default mode is now ‘dropped_and_held’.\n[*] Fixed SCP-1576 not spawning in-game.\n[*] Fixed grenades killing team members if the thrower disconnects from the server.\n[*] Fixed the holo sight attachment on the Logicer causing unintentional recoil reduction.\n[*] Fixed several small animation issues relating to the Logicer.\n[*] Fixed `ovr` game console command.\n[*] Fixed permissions related to Overwatch and class changing.\n[*] Fixed multiple typos on server log lines.\n[*] Fixed server creating a directory with port ‘0’.\n[*] Fixed exceptions related to debug log reader. \n[*] Fixed PlayerHandcuff event cancellation.\n[*] PlayerInteractDoor event is now fired upon interaction with a locked door.\n[/list]\n\nHave fun, and see you in the dark.\n~ Northwood Studios\n\n\n","feedlabel":"Community Announcements","date":1683658702,"feedname":"steam_community_announcements","feed_type":1,"appid":700330,"tags":["mod_reviewed","ModAct_1400956464_1683660038_0","ModAct_487486347_1683672188_4","ModAct_487486347_1683673088_4","mod_require_rereview"]},{"gid":"5133583642663533109","title":"13.0 Patreon Beta Closure","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5133583642663533109","is_external_url":true,"author":"☢Commander Shadow☢","contents":"Hello everyone, \n\nNow that the Patreon beta has reached its end, we want to thank everyone for their support and dedication throughout this period.\n\nThe update’s full release will become available [b]soon[/b]. First, we will be using the feedback and data collected to make some adjustments and fixes before the update goes live, so stay tuned to our Discord or social media for information on when the update will become playable.\n\nUntil then, we once again thank everyone who has supported us and tested the beta as we continue to improve SCP: SL.\n\n~ Northwood Studios\n","feedlabel":"Community Announcements","date":1682895606,"feedname":"steam_community_announcements","feed_type":1,"appid":700330},{"gid":"5133583642654731426","title":"Translations Feedback Survey","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5133583642654731426","is_external_url":true,"author":"ZirconZer0","contents":"Hello everyone!\n\nThe Translations team are currently undergoing an internal rework and therefore will be reviewing the quality of the current translations in-game. We invite you to complete the attached survey to share any thoughts and opinions regarding translation quality.\n\n[url=https://forms.gle/u9Zsx6zJVxTmfywq6]https://forms.gle/u9Zsx6zJVxTmfywq6[/url]\n\nWe are looking forward to your responses!\n\n[i]~ Northwood Studios[/i]","feedlabel":"Community Announcements","date":1682686955,"feedname":"steam_community_announcements","feed_type":1,"appid":700330}],"count":228}}